cnn_1
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
reshape_2 (Reshape)          (None, 40, 3)             0         
_________________________________________________________________
conv1d_2 (Conv1D)            (None, 31, 64)            1984      
_________________________________________________________________
max_pooling1d_2 (MaxPooling1 (None, 10, 64)            0         
_________________________________________________________________
global_average_pooling1d_2 ( (None, 64)                0         
_________________________________________________________________
dense_2 (Dense)              (None, 1)                 65        
=================================================================
Total params: 2,049
Trainable params: 2,049
Non-trainable params: 0
_________________________________________________________________
('train_score', [0.6819265604428936, 0.5609193100791052])
('test_score', [0.6912313447088293, 0.5310715485881844])
