cnn_3
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
reshape_8 (Reshape)          (None, 40, 3)             0         
_________________________________________________________________
conv1d_13 (Conv1D)           (None, 38, 64)            640       
_________________________________________________________________
max_pooling1d_10 (MaxPooling (None, 19, 64)            0         
_________________________________________________________________
conv1d_14 (Conv1D)           (None, 17, 64)            12352     
_________________________________________________________________
max_pooling1d_11 (MaxPooling (None, 8, 64)             0         
_________________________________________________________________
conv1d_15 (Conv1D)           (None, 6, 64)             12352     
_________________________________________________________________
max_pooling1d_12 (MaxPooling (None, 3, 64)             0         
_________________________________________________________________
global_average_pooling1d_3 ( (None, 64)                0         
_________________________________________________________________
dense_3 (Dense)              (None, 1)                 65        
=================================================================
Total params: 25,409
Trainable params: 25,409
Non-trainable params: 0
_________________________________________________________________
('train_score', [0.6601822615512547, 0.6038812594880762])
('test_score', [0.7073765285524192, 0.5210390773509334])
