cnn_2
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
reshape_6 (Reshape)          (None, 40, 3)             0         
_________________________________________________________________
conv1d_9 (Conv1D)            (None, 31, 64)            1984      
_________________________________________________________________
max_pooling1d_6 (MaxPooling1 (None, 15, 64)            0         
_________________________________________________________________
conv1d_10 (Conv1D)           (None, 6, 64)             41024     
_________________________________________________________________
max_pooling1d_7 (MaxPooling1 (None, 2, 64)             0         
_________________________________________________________________
global_average_pooling1d_1 ( (None, 64)                0         
_________________________________________________________________
dense_1 (Dense)              (None, 1)                 65        
=================================================================
Total params: 43,073
Trainable params: 43,073
Non-trainable params: 0
_________________________________________________________________
('train_score', [0.6023116372625772, 0.674331292030227])
('test_score', [0.7584407232987922, 0.5185533534277862])
